Revit 2027 API
StructuralSection.PlasticModulusWeakAxis Property
 Plastic section modulus in bending about main weak axis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PlasticModulusWeakAxis { get; set; }
Public Property PlasticModulusWeakAxis As Double
	Get
	Set
public:
property double PlasticModulusWeakAxis {
	double get ();
	void set (double value);
}
member PlasticModulusWeakAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace